; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p14---int100n150-m25---int100c110---s439---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 - fuellevel
)

(:init
(sum level0 level11 level11)
(sum level0 level13 level13)
(sum level0 level14 level14)
(sum level0 level16 level16)
(sum level0 level23 level23)
(sum level0 level25 level25)
(sum level1 level11 level12)
(sum level1 level13 level14)
(sum level1 level14 level15)
(sum level1 level16 level17)
(sum level1 level23 level24)
(sum level1 level25 level26)
(sum level2 level11 level13)
(sum level2 level13 level15)
(sum level2 level14 level16)
(sum level2 level16 level18)
(sum level2 level23 level25)
(sum level2 level25 level27)
(sum level3 level11 level14)
(sum level3 level13 level16)
(sum level3 level14 level17)
(sum level3 level16 level19)
(sum level3 level23 level26)
(sum level3 level25 level28)
(sum level4 level11 level15)
(sum level4 level13 level17)
(sum level4 level14 level18)
(sum level4 level16 level20)
(sum level4 level23 level27)
(sum level4 level25 level29)
(sum level5 level11 level16)
(sum level5 level13 level18)
(sum level5 level14 level19)
(sum level5 level16 level21)
(sum level5 level23 level28)
(sum level5 level25 level30)
(sum level6 level11 level17)
(sum level6 level13 level19)
(sum level6 level14 level20)
(sum level6 level16 level22)
(sum level6 level23 level29)
(sum level6 level25 level31)
(sum level7 level11 level18)
(sum level7 level13 level20)
(sum level7 level14 level21)
(sum level7 level16 level23)
(sum level7 level23 level30)
(sum level7 level25 level32)
(sum level8 level11 level19)
(sum level8 level13 level21)
(sum level8 level14 level22)
(sum level8 level16 level24)
(sum level8 level23 level31)
(sum level8 level25 level33)
(sum level9 level11 level20)
(sum level9 level13 level22)
(sum level9 level14 level23)
(sum level9 level16 level25)
(sum level9 level23 level32)
(sum level9 level25 level34)
(sum level10 level11 level21)
(sum level10 level13 level23)
(sum level10 level14 level24)
(sum level10 level16 level26)
(sum level10 level23 level33)
(sum level10 level25 level35)
(sum level11 level11 level22)
(sum level11 level13 level24)
(sum level11 level14 level25)
(sum level11 level16 level27)
(sum level11 level23 level34)
(sum level11 level25 level36)
(sum level12 level11 level23)
(sum level12 level13 level25)
(sum level12 level14 level26)
(sum level12 level16 level28)
(sum level12 level23 level35)
(sum level12 level25 level37)
(sum level13 level11 level24)
(sum level13 level13 level26)
(sum level13 level14 level27)
(sum level13 level16 level29)
(sum level13 level23 level36)
(sum level13 level25 level38)
(sum level14 level11 level25)
(sum level14 level13 level27)
(sum level14 level14 level28)
(sum level14 level16 level30)
(sum level14 level23 level37)
(sum level14 level25 level39)
(sum level15 level11 level26)
(sum level15 level13 level28)
(sum level15 level14 level29)
(sum level15 level16 level31)
(sum level15 level23 level38)
(sum level15 level25 level40)
(sum level16 level11 level27)
(sum level16 level13 level29)
(sum level16 level14 level30)
(sum level16 level16 level32)
(sum level16 level23 level39)
(sum level16 level25 level41)
(sum level17 level11 level28)
(sum level17 level13 level30)
(sum level17 level14 level31)
(sum level17 level16 level33)
(sum level17 level23 level40)
(sum level17 level25 level42)
(sum level18 level11 level29)
(sum level18 level13 level31)
(sum level18 level14 level32)
(sum level18 level16 level34)
(sum level18 level23 level41)
(sum level18 level25 level43)
(sum level19 level11 level30)
(sum level19 level13 level32)
(sum level19 level14 level33)
(sum level19 level16 level35)
(sum level19 level23 level42)
(sum level19 level25 level44)
(sum level20 level11 level31)
(sum level20 level13 level33)
(sum level20 level14 level34)
(sum level20 level16 level36)
(sum level20 level23 level43)
(sum level20 level25 level45)
(sum level21 level11 level32)
(sum level21 level13 level34)
(sum level21 level14 level35)
(sum level21 level16 level37)
(sum level21 level23 level44)
(sum level21 level25 level46)
(sum level22 level11 level33)
(sum level22 level13 level35)
(sum level22 level14 level36)
(sum level22 level16 level38)
(sum level22 level23 level45)
(sum level22 level25 level47)
(sum level23 level11 level34)
(sum level23 level13 level36)
(sum level23 level14 level37)
(sum level23 level16 level39)
(sum level23 level23 level46)
(sum level23 level25 level48)
(sum level24 level11 level35)
(sum level24 level13 level37)
(sum level24 level14 level38)
(sum level24 level16 level40)
(sum level24 level23 level47)
(sum level24 level25 level49)
(sum level25 level11 level36)
(sum level25 level13 level38)
(sum level25 level14 level39)
(sum level25 level16 level41)
(sum level25 level23 level48)
(sum level25 level25 level50)
(sum level26 level11 level37)
(sum level26 level13 level39)
(sum level26 level14 level40)
(sum level26 level16 level42)
(sum level26 level23 level49)
(sum level26 level25 level51)
(sum level27 level11 level38)
(sum level27 level13 level40)
(sum level27 level14 level41)
(sum level27 level16 level43)
(sum level27 level23 level50)
(sum level27 level25 level52)
(sum level28 level11 level39)
(sum level28 level13 level41)
(sum level28 level14 level42)
(sum level28 level16 level44)
(sum level28 level23 level51)
(sum level28 level25 level53)
(sum level29 level11 level40)
(sum level29 level13 level42)
(sum level29 level14 level43)
(sum level29 level16 level45)
(sum level29 level23 level52)
(sum level29 level25 level54)
(sum level30 level11 level41)
(sum level30 level13 level43)
(sum level30 level14 level44)
(sum level30 level16 level46)
(sum level30 level23 level53)
(sum level30 level25 level55)
(sum level31 level11 level42)
(sum level31 level13 level44)
(sum level31 level14 level45)
(sum level31 level16 level47)
(sum level31 level23 level54)
(sum level31 level25 level56)
(sum level32 level11 level43)
(sum level32 level13 level45)
(sum level32 level14 level46)
(sum level32 level16 level48)
(sum level32 level23 level55)
(sum level32 level25 level57)
(sum level33 level11 level44)
(sum level33 level13 level46)
(sum level33 level14 level47)
(sum level33 level16 level49)
(sum level33 level23 level56)
(sum level33 level25 level58)
(sum level34 level11 level45)
(sum level34 level13 level47)
(sum level34 level14 level48)
(sum level34 level16 level50)
(sum level34 level23 level57)
(sum level34 level25 level59)
(sum level35 level11 level46)
(sum level35 level13 level48)
(sum level35 level14 level49)
(sum level35 level16 level51)
(sum level35 level23 level58)
(sum level35 level25 level60)
(sum level36 level11 level47)
(sum level36 level13 level49)
(sum level36 level14 level50)
(sum level36 level16 level52)
(sum level36 level23 level59)
(sum level36 level25 level61)
(sum level37 level11 level48)
(sum level37 level13 level50)
(sum level37 level14 level51)
(sum level37 level16 level53)
(sum level37 level23 level60)
(sum level37 level25 level62)
(sum level38 level11 level49)
(sum level38 level13 level51)
(sum level38 level14 level52)
(sum level38 level16 level54)
(sum level38 level23 level61)
(sum level38 level25 level63)
(sum level39 level11 level50)
(sum level39 level13 level52)
(sum level39 level14 level53)
(sum level39 level16 level55)
(sum level39 level23 level62)
(sum level39 level25 level64)
(sum level40 level11 level51)
(sum level40 level13 level53)
(sum level40 level14 level54)
(sum level40 level16 level56)
(sum level40 level23 level63)
(sum level40 level25 level65)
(sum level41 level11 level52)
(sum level41 level13 level54)
(sum level41 level14 level55)
(sum level41 level16 level57)
(sum level41 level23 level64)
(sum level41 level25 level66)
(sum level42 level11 level53)
(sum level42 level13 level55)
(sum level42 level14 level56)
(sum level42 level16 level58)
(sum level42 level23 level65)
(sum level42 level25 level67)
(sum level43 level11 level54)
(sum level43 level13 level56)
(sum level43 level14 level57)
(sum level43 level16 level59)
(sum level43 level23 level66)
(sum level43 level25 level68)
(sum level44 level11 level55)
(sum level44 level13 level57)
(sum level44 level14 level58)
(sum level44 level16 level60)
(sum level44 level23 level67)
(sum level44 level25 level69)
(sum level45 level11 level56)
(sum level45 level13 level58)
(sum level45 level14 level59)
(sum level45 level16 level61)
(sum level45 level23 level68)
(sum level45 level25 level70)
(sum level46 level11 level57)
(sum level46 level13 level59)
(sum level46 level14 level60)
(sum level46 level16 level62)
(sum level46 level23 level69)
(sum level46 level25 level71)
(sum level47 level11 level58)
(sum level47 level13 level60)
(sum level47 level14 level61)
(sum level47 level16 level63)
(sum level47 level23 level70)
(sum level47 level25 level72)
(sum level48 level11 level59)
(sum level48 level13 level61)
(sum level48 level14 level62)
(sum level48 level16 level64)
(sum level48 level23 level71)
(sum level48 level25 level73)
(sum level49 level11 level60)
(sum level49 level13 level62)
(sum level49 level14 level63)
(sum level49 level16 level65)
(sum level49 level23 level72)
(sum level49 level25 level74)
(sum level50 level11 level61)
(sum level50 level13 level63)
(sum level50 level14 level64)
(sum level50 level16 level66)
(sum level50 level23 level73)
(sum level50 level25 level75)
(sum level51 level11 level62)
(sum level51 level13 level64)
(sum level51 level14 level65)
(sum level51 level16 level67)
(sum level51 level23 level74)
(sum level51 level25 level76)
(sum level52 level11 level63)
(sum level52 level13 level65)
(sum level52 level14 level66)
(sum level52 level16 level68)
(sum level52 level23 level75)
(sum level52 level25 level77)
(sum level53 level11 level64)
(sum level53 level13 level66)
(sum level53 level14 level67)
(sum level53 level16 level69)
(sum level53 level23 level76)
(sum level53 level25 level78)
(sum level54 level11 level65)
(sum level54 level13 level67)
(sum level54 level14 level68)
(sum level54 level16 level70)
(sum level54 level23 level77)
(sum level54 level25 level79)
(sum level55 level11 level66)
(sum level55 level13 level68)
(sum level55 level14 level69)
(sum level55 level16 level71)
(sum level55 level23 level78)
(sum level55 level25 level80)
(sum level56 level11 level67)
(sum level56 level13 level69)
(sum level56 level14 level70)
(sum level56 level16 level72)
(sum level56 level23 level79)
(sum level56 level25 level81)
(sum level57 level11 level68)
(sum level57 level13 level70)
(sum level57 level14 level71)
(sum level57 level16 level73)
(sum level57 level23 level80)
(sum level57 level25 level82)
(sum level58 level11 level69)
(sum level58 level13 level71)
(sum level58 level14 level72)
(sum level58 level16 level74)
(sum level58 level23 level81)
(sum level58 level25 level83)
(sum level59 level11 level70)
(sum level59 level13 level72)
(sum level59 level14 level73)
(sum level59 level16 level75)
(sum level59 level23 level82)
(sum level59 level25 level84)
(sum level60 level11 level71)
(sum level60 level13 level73)
(sum level60 level14 level74)
(sum level60 level16 level76)
(sum level60 level23 level83)
(sum level60 level25 level85)
(sum level61 level11 level72)
(sum level61 level13 level74)
(sum level61 level14 level75)
(sum level61 level16 level77)
(sum level61 level23 level84)
(sum level61 level25 level86)
(sum level62 level11 level73)
(sum level62 level13 level75)
(sum level62 level14 level76)
(sum level62 level16 level78)
(sum level62 level23 level85)
(sum level62 level25 level87)
(sum level63 level11 level74)
(sum level63 level13 level76)
(sum level63 level14 level77)
(sum level63 level16 level79)
(sum level63 level23 level86)
(sum level63 level25 level88)
(sum level64 level11 level75)
(sum level64 level13 level77)
(sum level64 level14 level78)
(sum level64 level16 level80)
(sum level64 level23 level87)
(sum level64 level25 level89)
(sum level65 level11 level76)
(sum level65 level13 level78)
(sum level65 level14 level79)
(sum level65 level16 level81)
(sum level65 level23 level88)
(sum level65 level25 level90)
(sum level66 level11 level77)
(sum level66 level13 level79)
(sum level66 level14 level80)
(sum level66 level16 level82)
(sum level66 level23 level89)
(sum level66 level25 level91)
(sum level67 level11 level78)
(sum level67 level13 level80)
(sum level67 level14 level81)
(sum level67 level16 level83)
(sum level67 level23 level90)
(sum level67 level25 level92)
(sum level68 level11 level79)
(sum level68 level13 level81)
(sum level68 level14 level82)
(sum level68 level16 level84)
(sum level68 level23 level91)
(sum level68 level25 level93)
(sum level69 level11 level80)
(sum level69 level13 level82)
(sum level69 level14 level83)
(sum level69 level16 level85)
(sum level69 level23 level92)
(sum level69 level25 level94)
(sum level70 level11 level81)
(sum level70 level13 level83)
(sum level70 level14 level84)
(sum level70 level16 level86)
(sum level70 level23 level93)
(sum level70 level25 level95)
(sum level71 level11 level82)
(sum level71 level13 level84)
(sum level71 level14 level85)
(sum level71 level16 level87)
(sum level71 level23 level94)
(sum level71 level25 level96)
(sum level72 level11 level83)
(sum level72 level13 level85)
(sum level72 level14 level86)
(sum level72 level16 level88)
(sum level72 level23 level95)
(sum level72 level25 level97)
(sum level73 level11 level84)
(sum level73 level13 level86)
(sum level73 level14 level87)
(sum level73 level16 level89)
(sum level73 level23 level96)
(sum level73 level25 level98)
(sum level74 level11 level85)
(sum level74 level13 level87)
(sum level74 level14 level88)
(sum level74 level16 level90)
(sum level74 level23 level97)
(sum level74 level25 level99)
(sum level75 level11 level86)
(sum level75 level13 level88)
(sum level75 level14 level89)
(sum level75 level16 level91)
(sum level75 level23 level98)
(sum level75 level25 level100)
(sum level76 level11 level87)
(sum level76 level13 level89)
(sum level76 level14 level90)
(sum level76 level16 level92)
(sum level76 level23 level99)
(sum level76 level25 level101)
(sum level77 level11 level88)
(sum level77 level13 level90)
(sum level77 level14 level91)
(sum level77 level16 level93)
(sum level77 level23 level100)
(sum level77 level25 level102)
(sum level78 level11 level89)
(sum level78 level13 level91)
(sum level78 level14 level92)
(sum level78 level16 level94)
(sum level78 level23 level101)
(sum level78 level25 level103)
(sum level79 level11 level90)
(sum level79 level13 level92)
(sum level79 level14 level93)
(sum level79 level16 level95)
(sum level79 level23 level102)
(sum level79 level25 level104)
(sum level80 level11 level91)
(sum level80 level13 level93)
(sum level80 level14 level94)
(sum level80 level16 level96)
(sum level80 level23 level103)
(sum level80 level25 level105)
(sum level81 level11 level92)
(sum level81 level13 level94)
(sum level81 level14 level95)
(sum level81 level16 level97)
(sum level81 level23 level104)
(sum level81 level25 level106)
(sum level82 level11 level93)
(sum level82 level13 level95)
(sum level82 level14 level96)
(sum level82 level16 level98)
(sum level82 level23 level105)
(sum level82 level25 level107)
(sum level83 level11 level94)
(sum level83 level13 level96)
(sum level83 level14 level97)
(sum level83 level16 level99)
(sum level83 level23 level106)
(sum level83 level25 level108)
(sum level84 level11 level95)
(sum level84 level13 level97)
(sum level84 level14 level98)
(sum level84 level16 level100)
(sum level84 level23 level107)
(sum level84 level25 level109)
(sum level85 level11 level96)
(sum level85 level13 level98)
(sum level85 level14 level99)
(sum level85 level16 level101)
(sum level85 level23 level108)
(sum level85 level25 level110)
(sum level86 level11 level97)
(sum level86 level13 level99)
(sum level86 level14 level100)
(sum level86 level16 level102)
(sum level86 level23 level109)
(sum level86 level25 level111)
(sum level87 level11 level98)
(sum level87 level13 level100)
(sum level87 level14 level101)
(sum level87 level16 level103)
(sum level87 level23 level110)
(sum level87 level25 level112)
(sum level88 level11 level99)
(sum level88 level13 level101)
(sum level88 level14 level102)
(sum level88 level16 level104)
(sum level88 level23 level111)
(sum level88 level25 level113)
(sum level89 level11 level100)
(sum level89 level13 level102)
(sum level89 level14 level103)
(sum level89 level16 level105)
(sum level89 level23 level112)
(sum level89 level25 level114)
(sum level90 level11 level101)
(sum level90 level13 level103)
(sum level90 level14 level104)
(sum level90 level16 level106)
(sum level90 level23 level113)
(sum level91 level11 level102)
(sum level91 level13 level104)
(sum level91 level14 level105)
(sum level91 level16 level107)
(sum level91 level23 level114)
(sum level92 level11 level103)
(sum level92 level13 level105)
(sum level92 level14 level106)
(sum level92 level16 level108)
(sum level93 level11 level104)
(sum level93 level13 level106)
(sum level93 level14 level107)
(sum level93 level16 level109)
(sum level94 level11 level105)
(sum level94 level13 level107)
(sum level94 level14 level108)
(sum level94 level16 level110)
(sum level95 level11 level106)
(sum level95 level13 level108)
(sum level95 level14 level109)
(sum level95 level16 level111)
(sum level96 level11 level107)
(sum level96 level13 level109)
(sum level96 level14 level110)
(sum level96 level16 level112)
(sum level97 level11 level108)
(sum level97 level13 level110)
(sum level97 level14 level111)
(sum level97 level16 level113)
(sum level98 level11 level109)
(sum level98 level13 level111)
(sum level98 level14 level112)
(sum level98 level16 level114)
(sum level99 level11 level110)
(sum level99 level13 level112)
(sum level99 level14 level113)
(sum level100 level11 level111)
(sum level100 level13 level113)
(sum level100 level14 level114)
(sum level101 level11 level112)
(sum level101 level13 level114)
(sum level102 level11 level113)
(sum level103 level11 level114)

(connected l0 l1)
(fuelcost level14 l0 l1)
(connected l0 l2)
(fuelcost level13 l0 l2)
(connected l0 l4)
(fuelcost level11 l0 l4)
(connected l1 l0)
(fuelcost level14 l1 l0)
(connected l1 l2)
(fuelcost level23 l1 l2)
(connected l1 l4)
(fuelcost level25 l1 l4)
(connected l2 l0)
(fuelcost level13 l2 l0)
(connected l2 l1)
(fuelcost level23 l2 l1)
(connected l2 l4)
(fuelcost level11 l2 l4)
(connected l3 l4)
(fuelcost level16 l3 l4)
(connected l4 l0)
(fuelcost level11 l4 l0)
(connected l4 l1)
(fuelcost level25 l4 l1)
(connected l4 l2)
(fuelcost level11 l4 l2)
(connected l4 l3)
(fuelcost level16 l4 l3)

(at t0 l1)
(fuel t0 level114)
(= (total-cost) 0)

(at p0 l3)
(at p1 l3)
(at p2 l0)
(at p3 l1)
(at p4 l1)
(at p5 l4)
(at p6 l4)
(at p7 l2)
(at p8 l2)
(at p9 l1)
(at p10 l1)
(at p11 l4)
(at p12 l1)
(at p13 l2)
)

(:goal
(and
(at p0 l2)
(at p1 l2)
(at p2 l2)
(at p3 l4)
(at p4 l3)
(at p5 l2)
(at p6 l3)
(at p7 l4)
(at p8 l1)
(at p9 l3)
(at p10 l0)
(at p11 l1)
(at p12 l2)
(at p13 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p9 t0 l1)
   deleted: (at p9 l1)
   added: (in p9 t0)
   goals met: 0 of 14
2. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 0 of 14
3. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 0 of 14
4. (load p12 t0 l1)
   deleted: (at p12 l1)
   added: (in p12 t0)
   goals met: 0 of 14
5. (load p10 t0 l1)
   deleted: (at p10 l1)
   added: (in p10 t0)
   goals met: 0 of 14
6. (drive t0 l1 l2 level91 level23 level114)
   deleted: (at t0 l1) (fuel t0 level114)
   added: (at t0 l2) (fuel t0 level91)
   goals met: 0 of 14
7. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 0 of 14
8. (drive t0 l2 l0 level78 level13 level91)
   deleted: (at t0 l2) (fuel t0 level91)
   added: (at t0 l0) (fuel t0 level78)
   goals met: 0 of 14
9. (unload p10 t0 l0)
   deleted: (in p10 t0)
   added: (at p10 l0)
   goals met: 1 of 14
10. (load p2 t0 l0)
   deleted: (at p2 l0)
   added: (in p2 t0)
   goals met: 1 of 14
11. (drive t0 l0 l4 level67 level11 level78)
   deleted: (at t0 l0) (fuel t0 level78)
   added: (at t0 l4) (fuel t0 level67)
   goals met: 1 of 14
12. (load p11 t0 l4)
   deleted: (at p11 l4)
   added: (in p11 t0)
   goals met: 1 of 14
13. (load p5 t0 l4)
   deleted: (at p5 l4)
   added: (in p5 t0)
   goals met: 1 of 14
14. (load p6 t0 l4)
   deleted: (at p6 l4)
   added: (in p6 t0)
   goals met: 1 of 14
15. (drive t0 l4 l3 level51 level16 level67)
   deleted: (at t0 l4) (fuel t0 level67)
   added: (at t0 l3) (fuel t0 level51)
   goals met: 1 of 14
16. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 1 of 14
17. (load p1 t0 l3)
   deleted: (at p1 l3)
   added: (in p1 t0)
   goals met: 1 of 14
18. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 2 of 14
19. (unload p6 t0 l3)
   deleted: (in p6 t0)
   added: (at p6 l3)
   goals met: 3 of 14
20. (unload p9 t0 l3)
   deleted: (in p9 t0)
   added: (at p9 l3)
   goals met: 4 of 14
21. (drive t0 l3 l4 level35 level16 level51)
   deleted: (at t0 l3) (fuel t0 level51)
   added: (at t0 l4) (fuel t0 level35)
   goals met: 4 of 14
22. (unload p3 t0 l4)
   deleted: (in p3 t0)
   added: (at p3 l4)
   goals met: 5 of 14
23. (unload p7 t0 l4)
   deleted: (in p7 t0)
   added: (at p7 l4)
   goals met: 6 of 14
24. (drive t0 l4 l2 level24 level11 level35)
   deleted: (at t0 l4) (fuel t0 level35)
   added: (at t0 l2) (fuel t0 level24)
   goals met: 6 of 14
25. (load p13 t0 l2)
   deleted: (at p13 l2)
   added: (in p13 t0)
   goals met: 6 of 14
26. (load p8 t0 l2)
   deleted: (at p8 l2)
   added: (in p8 t0)
   goals met: 6 of 14
27. (unload p0 t0 l2)
   deleted: (in p0 t0)
   added: (at p0 l2)
   goals met: 7 of 14
28. (unload p1 t0 l2)
   deleted: (in p1 t0)
   added: (at p1 l2)
   goals met: 8 of 14
29. (unload p12 t0 l2)
   deleted: (in p12 t0)
   added: (at p12 l2)
   goals met: 9 of 14
30. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 10 of 14
31. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 11 of 14
32. (drive t0 l2 l1 level1 level23 level24)
   deleted: (at t0 l2) (fuel t0 level24)
   added: (at t0 l1) (fuel t0 level1)
   goals met: 11 of 14
33. (unload p11 t0 l1)
   deleted: (in p11 t0)
   added: (at p11 l1)
   goals met: 12 of 14
34. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 13 of 14
35. (unload p8 t0 l1)
   deleted: (in p8 t0)
   added: (at p8 l1)
   goals met: 14 of 14
